<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>隐私服务规范</title>
</head>
<body >
    <div style="width:80%;margin-left: auto;margin-right: auto;">
      <center> <h2> “UHA-友哈”软件服务使用协议</h2></center>


<p>欢迎您使用史塔克“UHA-友哈”软件及服务！</p>
<p>本服务使用协议（以下简称"使用协议"）是由用户 (您)与“UHA-友哈”就提供服务所订立的相关权利义务规范，本服务条款对您及“UHA-友哈”均具有法律效力。</p>
<ul class="list-text">
<li>1.确认并接受
    <ul>
        <li>1.1 根据以下服务条款为您提供服务。这些条款可由“UHA-友哈”团队随时更新，且毋须另行通知。“UHA-友哈”使用协议（以下简称"使用协议"）一旦发生变动将会在网页上公布修改内容。修改后的使用协议一旦在网页上公布即有效即时代替原来的使用协议。此外，当您使用“UHA-友哈”特殊服务时，您和“UHA-友哈”应遵守“UHA-友哈”随时公布的与该服务相关的指引和规则。前述所有的指引和规则，均构成本使用协议的一部分。</li>
        <li>1.2 您在使用“UHA-友哈”提供的各项服务之前，应仔细阅读本使用协议。如您不同意本使用协议及或随时对其的修改，请您立即停止使用“UHA-友哈”所提供的全部服务；若您继续使用“UHA-友哈”的服务，即视为您已了解并完全同意本使用协议各项内容，包括“UHA-友哈”对使用协议随时所做的任何修改，并成为“UHA-友哈” 用户（以下简称"用户"）。</li>
    </ul>
 </li>
<li>2.服务说明
    <ul>
        <li>2.1目前“UHA-友哈”根据内容向用户如下服务：照片的贴图处理及发布，并对自己或者他人发布的的照片进行分享、点赞、评论、等等行为。您了解并同意，本服务仅依其当前所呈现的状况提供，对于任何用户信息或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，“UHA-友哈”均不承担任何责任。“UHA-友哈”保留不经事先通知为升级、维护或其它目的暂停本服务任何部分的权利。
        <li>2.2 请您理解，“UHA-友哈”仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人手机与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网使用移动网而支付的手机费）均应由用户自行负担。
        <li>2.3 用户在接受“UHA-友哈”各项服务的同时，同意接受“UHA-友哈”提供的各类信息服务。这些信息所涉及的内容包括以文字、照片形式表现的各类宣传信息、活动信息、订单信息、商业信息以及“UHA-友哈”合作伙伴信息，该类信息的提供方式包括但不限于电子邮件、短信息。您在"“UHA-友哈”"授权登录或实际使用"“UHA-友哈”"的服务，即表明您已同意接受此项服务。
        <li>2.4 “UHA-友哈”为用户提供合法的、健康的产品及服务，但是用户应对其使用“UHA-友哈”自行承担责任及风险，“UHA-友哈”在任何情况下不就因使用或不能使用“UHA-友哈”提供的服务所发生的特殊的、意外的、直接或间接的损失承担赔偿责任。
        <li>2.5 除您与“UHA-友哈”另行约定外，“UHA-友哈”保留随时修改或中断服务而不需通知您的权利。“UHA-友哈”不需要就此对用户或第三方负责。
</ul></li>
<li>
3.用户使用基本规则
    <ul>
<li>3.1 您授权成功登录后，便成为“UHA-友哈”的合法用户；您的密码和帐号遭到未授权的使用或发生其他任何安全问题，应立即通知“UHA-友哈”。
<li>3.2 您同意遵守中华人民共和国相关法律法规的所有规定，如您的行为违反国家法律和法规的任何规定，有可能构成犯罪的，将被追究刑事责任，并由您承担全部法律责任。
<li>3.3 “UHA-友哈”承诺仅根据本网站服务目的使用您的个人信息。服务目的包括但不限于交易确认、交易支付、政策更新、用户通知、发送活动信息、商业信息以及其他与服务相关的辅助服务等。如您认为“UHA-友哈”超范围使用了您的个人信息，请立即与客服中心联系，“UHA-友哈”将核实处理。
<li>3.4 用户在“UHA-友哈”中可通过照片形式发布自己的穿衣搭配，分享体验等或参加各类线上活动，但不得使用“UHA-友哈”服务发送或传播敏感信息和违反国家法律法规政策的信息，此类信息包括但不限于：
    <ul>
        <li>- 3.4.1 反对宪法所确定的基本原则的；
        <li>- 3.4.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
        <li>- 3.4.3 损害国家荣誉和利益的；
        <li>- 3.4.4 煽动民族仇恨、民族歧视，破坏民族团结的；
        <li>- 3.4.5 破坏国家宗教政策，宣扬邪教和封建迷信的；
        <li>- 3.4.6 散布谣言，扰乱社会秩序，破坏社会稳定的；
        <li>- 3.4.7 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
        <li>- 3.4.8 侮辱或者诽谤他人，侵害他人合法权益的；
        <li>- 3.4.9 含有法律、行政法规禁止的其他内容的；
        <li>- 3.4.10 含有“UHA-友哈”认为不适合展示的内容；
</ul></li>
<li>
3.5 用户在发布照片、品牌信息及使用“UHA-友哈”服务过程中，还必须遵循以下原则：
<ul>
        <li>- 3.5.1 不能以任何方式危害他人的合法权益；
        <li>- 3.5.2 不能因任何非法目的而使用网络服务系统，遵守所有与网络服务有关的网络协议、规定和程序；不得利用“UHA-友哈”网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；
        <li>- 3.5.3 不能进行任何未经“UHA-友哈”许可的商业广告行为，不能将广告函件、促销资料、垃圾邮件等，加以上传下载、张贴、发送电子邮件或以其它方式传送；不得对“UHA-友哈”上的任何数据作商业性利用；
        <li>- 3.5.4 遵守中国有关的法律和法规：<br/>
            不能将侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容加以上传下载、张贴、发送电子邮件或以其它方式传送；<br/>
            不能将无权传送的内容（例如内部资料、机密资料）进行上传下载、张贴、发送电子邮件或以其它方式传送；
        <li>- 3.5.5 不能干扰或破坏本服务或与本服务相连线之服务器和网络，不能违反任何关于本服务连线网络之规定、程序、政策或规范；
        <li>- 3.5.6 不能跟踪、人肉搜索或以其它方式骚扰他人。
        <li>- 3.5.7 不能故意或非故意地违反任何适用的当地、国家法律，以及任何具有法律效力的规则；
</ul></li><li>
3.6 您在此承诺不经“UHA-友哈”书面同意，不能利用“UHA-友哈”各项服务在“UHA-友哈”平台上进行销售或其他商业性行为。如用户违反此约定，“UHA-友哈”将依法追究您的违约责任，由此给“UHA-友哈”造成损失的，“UHA-友哈”有权进行追偿。
</li></ul>
<li>
4.用户隐私保护<br />
您提供的登记资料及“UHA-友哈”保留的有关您的若干其它资料将受到中国有关隐私的法律和本公司《隐私声明》之规范。
</li>
<li>
5.发布的公开信息
    <ul>
    <li>- 5.1 在本使用协议中，"本服务公开使用区域"系指一般公众可以使用的区域；
    <li>- 5.2 用户在“UHA-友哈”上传或发布的内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益，用户同意授予“UHA-友哈”所有上述内容在全球范围内的免费、不可撤销的、永久的、可再许可或转让的独家使用权许可，据该许可“UHA-友哈”将有权以展示、推广及其他不为我法律所禁止的方式使用前述内容。
</ul></li>
<li>
6.与广告商及其他第三方进行交易<br />
您通过本网站与广告商及其他第三方进行任何形式的通讯或商业往来，或参与促销活动，包含相关商品或服务之付款及交付，以及达成的其它任何相关条款、条件、保证或声明，完全为您与广告商及其他第三方之间之行为。您因前述任何交易或前述广告商及其他第三方而遭受的任何性质的损失或损害，“UHA-友哈”对此不负任何法律责任。
</li>
<li>
7.免责声明
    <ul>
    <li>7.1 “UHA-友哈”对于任何自本应用而获得的他人的信息、内容或者广告宣传等任何资讯（以下统称"信息"），不保证真实、准确和完整性。如果任何单位或者个人 通过上述"信息"而进行任何行为，须自行甄别真伪和谨慎预防风险，否则，无论何种原因，本应用不对任何非与本应用直接发生的交易和/或行为承担任何直接、 间接、附带或衍生的损失和责任。
    <li>7.2 “UHA-友哈”有权但无义务，改善或更正本应用任何部分之任何疏漏、错误。
    <li>7.3 “UHA-友哈”不保证（包括但不限于）：<br />
        - 本应用适合用户的使用要求；<br />
        - 本应用不受干扰，及时、安全、可靠或不出现错误；<br />
        - 用户经由本应用取得的任何产品、服务或其他材料符合用户的期望。
    <li>7.4 用户使用经由本应用取得的任何资料，其风险自行负担；因该等使用导致用户手机系统损坏或资料流失，用户应负完全责任。
    <li>7.5 基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，“UHA-友哈”不承担任何直接、间接、附带、衍生或惩罚性的赔偿：
    <ul>
        <li>- 7.5.1 本应用使用或无法使用；
        <li>- 7.5.2 经由本应用购买或取得的任何产品、资料或服务；
        <li>- 7.5.3 用户资料遭到未授权的使用或修改；
        <li>- 7.5.4 其他与本应用相关的事宜；
        <li>- 7.5.5 第三方以任何方式发布或投递欺诈性信息，或诱导用户受到经济损失。
    </ul></li>
</ul>
</li>
<li>
8.国际使用之特别敬告<br />
您已了解国际互联网的无国界性，同意遵守当地所有关于网上行为及内容之法律法规。您特别同意遵守有关从中国或您所在国家或地区输出信息之传输的所有适用法律法规。
</li>
<li>
9.赔偿<br />
由于您通过本服务提供、发布或传送之内容、您与本服务连线、您违反本使用协议、或您侵害他人任何权利因而衍生或导致任何第三人提出任何索赔或请求，包括合理的律师费，您同意赔偿“UHA-友哈” 及其子公司、关联企业、高级职员、代理人、品牌共有人或其它合作伙伴及员工，并使其免受损害，并承担由此引发的全部法律责任。
</li>
<li>
10.终止服务<br />
您同意“UHA-友哈”基于其自行之考虑，因任何理由，包含但不限于缺乏使用，或“UHA-友哈”认为您已经违反本使用协议的文字及精神，终止您的帐号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本使用协议任何规定提供之本服务，无需进行事先通知即可中断或终止， “UHA-友哈”可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，并禁止继续使用前述文件或本服务。此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，“UHA-友哈”对您或任何第三人均不承担任何责任。
</li>
<li>
11.“UHA-友哈”商标信息 <br />
未经“UHA-友哈”事先书面同意，您同意不将“UHA-友哈”及其他“UHA-友哈”注册商标、标志及产品、服务名称以任何方式展示、使用、作其它处理。
</li>
<li>
12.法律的适用和管辖
<ul>
<li>12.1 本使用协议及您与“UHA-友哈”之关系，均受到中华人民共和国法律管辖。您与“UHA-友哈”就本服务、本使用协议或其它有关事项发生的争议，应首先友好协商解决，协商不成时应提请中国国际经济贸易仲裁委员会仲裁，仲裁裁决是终局性的，对双方均有约束力； 
<li>12.2 “UHA-友哈”未行使或执行本使用协议任何权利或规定，不构成对前述权利或权利之放弃；
<li>12.3 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
<li>12.4 本使用协议之标题仅供方便而设，不具任何法律或契约效果；
<li>12.5 上海史塔克文化传媒有限公司对本使用协议享有最终解释权。 
</ul>
    </li>
        </ul>
    </div>
</body>
</html>